tests/sample-data/text/invoice_01.txt

Invoice
Invoice number TEST-INV-0001
Date of issue June 12, 2025
Date due June 12, 2025
Vendor1, LLC Bill to
548 Market Street Example Company Ltd
PMB 97273 Redacted Street
San Francisco, California 94104-5401 Redacted City
United States ZZ99 9ZZ
example@Vendor1.com example@example.com
GB VAT REDACTED_GB_VAT
RU KPP REDACTED_KPP
$24.00 USD due June 12, 2025
Pay online
Description Qty Unit price Tax Amount
Sample Product Subscription 1 $20.00 20% $20.00
Jun 12 – Jul 12, 2025
Subtotal $20.00
Total excluding tax $20.00
$4.00
VAT - United Kingdom 20% on $20.00
£2.95
Total $24.00
Amount due $24.00 USD
Page 1 of 1
